
## Plan Result




<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.fis-ds-update-session-storage.azurerm_private_endpoint.this[0]
  * module.fis-ds-update-session-storage.azurerm_redis_cache.redis
  * module.fis-ds-update-session-storage.azurerm_resource_group.cache-resourcegroup[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.fis-ds-update-session-storage.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "fis-ds-update-web-aat-aat"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "fis-ds-update-web-aat-cache-aat"
      + subnet_id                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-2-aat"
      + tags                     = {
          + "application"         = "family-integration-systems"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/fis-ds-update-web.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#family-integration-devs"
          + "environment"         = "staging"
          + "managedBy"           = "Family Integration Stream"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "redis-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "fis-ds-update-web-aat-aat"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # module.fis-ds-update-session-storage.azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "P"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + minimum_tls_version           = "1.2"
      + name                          = "fis-ds-update-web-aat-aat"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = false
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "fis-ds-update-web-aat-cache-aat"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Premium"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "application"         = "family-integration-systems"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/fis-ds-update-web.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#family-integration-devs"
          + "environment"         = "staging"
          + "managedBy"           = "Family Integration Stream"
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = 642
          + maxmemory_delta                 = 642
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = 642
        }
    }

  # module.fis-ds-update-session-storage.azurerm_resource_group.cache-resourcegroup[0] will be created
  + resource "azurerm_resource_group" "cache-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "fis-ds-update-web-aat-cache-aat"
      + tags     = {
          + "application"         = "family-integration-systems"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/fis-ds-update-web.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#family-integration-devs"
          + "environment"         = "staging"
          + "managedBy"           = "Family Integration Stream"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":148,"Program":"tfcmt","SHA1":"","Vars":{}} -->